app/controllers/microposts_controller.rb

  def index
    @microposts = Micropost.all
---
SELECT "microposts".* FROM "microposts"

  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "te_mp_2011212130"], ["user_id", 1], ["created_at", "2020-11-21 12:30:16.118340"], ["updated_at", "2020-11-21 12:30:16.118340"]]

  def update
    respond_to do |format|
      if @micropost.update(micropost_params)
---
UPDATE "microposts" SET "content" = $1, "updated_at" = $2 WHERE "microposts"."id" = $3  [["content", "te_mp_2011212132_ca"], ["updated_at", "2020-11-21 17:05:25.935998"], ["id", 2]]

    def set_micropost
      @micropost = Micropost.find(params[:id])
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]